### Question 1

In [2]:
import pandas as pd
import numpy as np

In [3]:
fruits = pd.Series(['mango','cherry','chiku','apple','orange'])
fruits

0     mango
1    cherry
2     chiku
3     apple
4    orange
dtype: object

### Question 2

In [4]:
name = pd.Series(['Alice','Bob','Charlie'])
age = pd.Series([25,30,35])
city = pd.Series(['Pune','Mumbai','Nagpur'])

In [5]:
age

0    25
1    30
2    35
dtype: int64

In [15]:
df = pd.DataFrame ({
    'name':name,
    'age':age,
    'city':city
})
df

      name  age    city
0    Alice   25    Pune
1      Bob   30  Mumbai
2  Charlie   35  Nagpur

### Question 3

In [16]:
x =  np.random.randint(1, 101, (3, 3))
df1 = pd.DataFrame(x)
df1.columns = ['A', 'B', 'C']

In [17]:
x

array([[ 9, 34, 91],
       [86,  8, 51],
       [70, 89, 42]])

### Question 4

In [18]:
df.head(2)

    name  age    city
0  Alice   25    Pune
1    Bob   30  Mumbai

In [19]:
df.tail(1)

      name  age    city
2  Charlie   35  Nagpur

In [20]:
df.shape

(3, 3)

### Question 5

In [21]:

df.info

<bound method DataFrame.info of       name  age    city
0    Alice   25    Pune
1      Bob   30  Mumbai
2  Charlie   35  Nagpur>

In [22]:
df.describe

<bound method NDFrame.describe of       name  age    city
0    Alice   25    Pune
1      Bob   30  Mumbai
2  Charlie   35  Nagpur>

### Question 6

In [23]:
x =df.loc[:,['name','city']]

In [24]:
x

      name    city
0    Alice    Pune
1      Bob  Mumbai
2  Charlie  Nagpur

### Question 7

In [25]:
df.iloc[1:2,0:2]

  name  age
1  Bob   30

### Question 8

In [26]:
re = { 'age' : 'years'}

In [27]:
df.rename( columns = re)

      name  years    city
0    Alice     25    Pune
1      Bob     30  Mumbai
2  Charlie     35  Nagpur

In [34]:
df

      name  age    city
0    Alice   25    Pune
1      Bob   30  Mumbai
2  Charlie   35  Nagpur

### Question 9

In [28]:
df.drop('city',axis = 1)

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

### Quesion 10

In [35]:
df['age'] = df['age'] + 5

In [36]:
df

      name  age    city
0    Alice   30    Pune
1      Bob   35  Mumbai
2  Charlie   40  Nagpur